app/controllers/movies_controller.rb

  def find_by_director
    @movie = Movie.find(params[:id])
    if(@movie.director.empty?)
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "movies".* FROM "movies" WHERE "movies"."director" = 'Terrr'